<template>
  <div class="container with-nav">
    <div class="card">
      <h3>История создания</h3>
      <hr>
      <p>
        Сама по себе идея нереляционных баз данных не нова, а использование нереляционных хранилищ началось ещё во
        времена первых компьютеров. Нереляционные базы данных процветали во времена мэйнфреймов, а позднее, во времена
        доминирования реляционных СУБД, нашли применение в специализированных хранилищах, например, иерархических
        службах каталогов. Появление же нереляционных СУБД нового поколения произошло из-за необходимости создания
        параллельных распределённых систем для высокомасштабируемых интернет-приложений, таких как поисковые системы.
      </p>
      <div class="format-image responsive">
        <img class="img-style responsive history-img" src="https://oracle-patches.com/images/2021/03/13/NoSQL_databases_Case_study_large.png"
             width="766"
             alt="506">
      </div>
      <p>
        В начале 2000-х годов Google построил свою высокомасштабируемую поисковую систему и приложения: GMail, Google
        Maps, Google Earth и т. п., решая проблемы масштабируемости и параллельной обработки больших объёмов данных. В
        результате была создана распределённая файловая система и распределённая система координации, хранилище семейств
        колонок (англ. column family store), среда выполнения, основанная на алгоритме MapReduce. Публикация компанией
        Google описаний этих технологий привела к всплеску интереса среди разработчиков открытого программного
        обеспечения, в результате чего был создан Hadoop и запущены связанные с ним проекты, призванные создать подобные
        Google технологии. Через год, в 2007 году, примеру Google последовал Amazon.com, опубликовав статьи о
        высокодоступной базе данных Amazon DynamoDB.

        Поддержка гигантов индустрии менее чем за пять лет привела к широкому распространению технологий NoSQL (и
        подобных) для управления «большими данными», а к делу присоединились другие большие и маленькие компании, такие
        как: IBM, Facebook, Netflix, eBay, Hulu, Yahoo!, со своими проприетарными и открытыми решениями.</p>
    </div>
  </div>
</template>

<script>
export default {
  name: "TheHistory"
}
</script>

<style scoped>

</style>
